"""
В переменную example запишите любую строку.
Выведите на экран(в консоль) первый сивол этой строки.
Выведите на экран(в консоль) последний сивол этой строки (используя отрицательный индекс).
Выведите на экран(в консоль) вторую половину этой строки (С нечётным количеством символов: 'Urban' -> 'ban').
Выведите на экран(в консоль) это слово наоборот.
Выведите на экран(в консоль) каждый второй символ этой строки. (Пример: 'Тапинамбур'->'аиабр')
"""

example = "Тапинамбур"
print(example[0])
print(example[-1])
print(example[len(example) // 2 :])
print(example[::-1])
print(example[1::2])