"""
Создайте новую функцию def test...
Создайте две переменные a и b внутри пространства имен функции test
Распечатайте a и b внутри функции test
Создайте функцию def test2 с тремя параметрами, функция должна распечатывать все три параметра внутри своего тела
В ответ прикрепите получившийся файл main.py
"""


def test():
    a, b = 1, 2
    print(a, b)


def test2():
    a, b, c = 4, 5, 6
    print(a, b, c)
